"""
Mass table of amino acids
"""

# TODO: 여기 있는 mass 는 m/z 인가 m 인가
# 그렇다면 min max feature 들은 m/z 으로 계산하는가 m 으로 계산하는가

def get_aa_mass(aa):
  return aa_mass_table[aa]

aa_mass_table = {
  'A' : 71.037114,
  'C' : 103.00919,
  'D' : 115.02694,
  'E' : 129.04259,
  'F' : 147.06841,
  'G' : 57.021464,
  'H' : 137.05891,
  'I' : 113.08406,
  'K' : 128.09496,
  'L' : 113.08406,
  'M' : 131.04048,
  'N' : 114.04293,
  'P' : 97.052764,
  'Q' : 128.05858,
  'R' : 156.10111,
  'S' : 87.032029,
  'T' : 101.04768,
  'V' : 99.068414,
  'W' : 186.07931,
  'Y' : 163.06333
}